Учет_ФК/src/Documents/ФормированиеПартийПродукцииДляПереработки/ФормированиеПартийПродукцииДляПереработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ФормированиеПартийПродукцииДляПереработки</name>
  <registerRecords>InformationRegister.ДанныеПодготовкиКПереработке</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПартииПереработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>ТранспортировочноеМесто</name>
      <type>
        <types>CatalogRef.ТранспортировочныеМеста</types>
      </type>
    </attributes>
    <attributes>
      <name>ПартияПродукции</name>
      <type>
        <types>CatalogRef.ПартииПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесБруттоВлажный</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНеттоВлажный</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПломбы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерМестаВПартии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_ФК/src/InformationRegisters/ДанныеПодготовкиКПереработке/ДанныеПодготовкиКПереработке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеПодготовкиКПереработке</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НомерПартииПереработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТранспортировочноеМесто</name>
    <type>
      <types>CatalogRef.ТранспортировочныеМеста</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Учет_ФК/src/InformationRegisters/ДанныеЗатаркиТранспортировочныхМест/ДанныеЗатаркиТранспортировочныхМест.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеЗатаркиТранспортировочныхМест</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииПродукции</types>
    </type>
  </resources>
  <resources>
    <name>ВесБруттоВлажный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоВлажный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерПломбы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Влажность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерМеста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоСухой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТранспортировочноеМесто</name>
    <type>
      <types>CatalogRef.ТранспортировочныеМеста</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Учет_ФК/src/InformationRegisters/ДанныеЛабораторныхИсследований/ДанныеЛабораторныхИсследований.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеЛабораторныхИсследований</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СодержаниеAu</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказательТочностиСодержанияAu</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СодержаниеAg</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказательТочностиСодержанияAg</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПримесиSобщ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказательТочностиПримесиSобщ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПримесиCорг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказательТочностиПримесиCорг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПримесиAs</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказательТочностиПрмесиAs</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПримесиFe</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказательТочностиПрмесиFe</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЛабораторнаяПроба</name>
    <type>
      <types>CatalogRef.ЛабораторныеПробы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииПродукции</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Учет_ФК/src/Documents/ФормированиеПартийПродукцииДляПереработки/ManagerModule.bsl
// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область ПрограммныйИнтерфейс
// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "УчетФлотоконцентратаПоПартиям";
	КомандаПечати.Представление = НСтр("ru = 'Параметры партии переработки'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок       = 1;
			
КонецПроцедуры
#КонецОбласти

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "УчетФлотоконцентратаПоПартиям") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "УчетФлотоконцентратаПоПартиям", "Учет флотоконцентрата по партиям",
			СформироватьПечатнуюФормуУчетФлотоконцентратаПоПартиям(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),,);
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьНаименованиеПоставщика(Ссылка)
	
	ТаблицаПродукции = Ссылка.Продукция.Выгрузить();
	ТаблицаПродукции.Свернуть("ПартияПродукции","");
	Если ТаблицаПродукции.Количество()=1 Тогда
		ПартияТабличнойЧасти 		= ТаблицаПродукции[0].ПартияПродукции;
		Если НЕ ПартияТабличнойЧасти = Неопределено Тогда 
			НаименованиеВладельцаПартии	= pm_ОбщегоНазначения.ОписаниеОрганизации(ПартияТабличнойЧасти.ОрганизацияВладелец,"НаименованиеСокращенное");
		Иначе 
			НаименованиеВладельцаПартии	= "";
		КонецЕсли;
		Возврат НаименованиеВладельцаПартии
	Иначе 
		Возврат "";
	КонецЕсли;
		
КонецФункции

Функция СформироватьПечатнуюФормуУчетФлотоконцентратаПоПартиям(МассивОбъектов, ОбъектыПечати, ПараметрыПечати) Экспорт
	
	ТабличныйДокумент 							= Новый ТабличныйДокумент;
	ТабличныйДокумент.РазмерКолонтитулаСверху 	= 0;
	ТабличныйДокумент.РазмерКолонтитулаСнизу 	= 0;
	ТабличныйДокумент.ПолеСлева					= 25;
	ТабличныйДокумент.АвтоМасштаб 				= Истина;
	ТабличныйДокумент.ОриентацияСтраницы 		= ОриентацияСтраницы.Ландшафт;
	
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УчетФлотоконцентратаПоПартиям";

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ФормированиеПартийПродукцииДляПереработки.ПФ_MXL_УчетФлотоконцентратаПоПартиям");

	ОбластьШапка	= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока	= Макет.ПолучитьОбласть("Строка");
	ОбластьИтог		= Макет.ПолучитьОбласть("Итог");
	
	Для Каждого СсылкаНаОбъект Из МассивОбъектов Цикл 
		
		НаименованиеОрганизации 										= pm_ОбщегоНазначения.ОписаниеОрганизации(СсылкаНаОбъект.Организация,"НаименованиеСокращенное");
		НаименованиеОрганизацииПоставщика								= ПолучитьНаименованиеПоставщика(СсылкаНаОбъект);
		ОбластьШапка.Параметры.ЗаголовокОтчета 							= "Параметры партии флотоконцентрата для переработки № "+СокрЛП(СсылкаНаОбъект.НомерПартииПереработки)+", Производитель продукции: " + НаименованиеОрганизации;
		ОбластьШапка.Параметры.НаименованиеОрганизацииПартии 			= "№ партии переработки";
		ОбластьШапка.Параметры.НаименованиеОрганизацииПоставщикаПартии	= "№ партии производителя";
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДанныеПодготовкиКПереработке.ТранспортировочноеМесто КАК ТранспортировочноеМесто
			|ПОМЕСТИТЬ вт_ДанныеПодготовкиКПереработки
			|ИЗ
			|	РегистрСведений.ДанныеПодготовкиКПереработке КАК ДанныеПодготовкиКПереработке
			|ГДЕ
			|	ДанныеПодготовкиКПереработке.Регистратор.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	вт_ДанныеПодготовкиКПереработки.ТранспортировочноеМесто.Код КАК ТранспортировочноеМесто,
			|	ДанныеЗатаркиТранспортировочныхМест.Партия.Код КАК НомПартииПоставщик,
			|	ДанныеЗатаркиТранспортировочныхМест.ВесБруттоВлажный КАК ВесБруттоСырой,
			|	ДанныеЗатаркиТранспортировочныхМест.ВесНеттоВлажный КАК ВесНеттоСырой,
			|	ДанныеЗатаркиТранспортировочныхМест.Влажность КАК Влажность,
			|	ДанныеЗатаркиТранспортировочныхМест.НомерМеста КАК НомерМеста,
			|	ВЫРАЗИТЬ(ДанныеЗатаркиТранспортировочныхМест.ВесНеттоВлажный - ДанныеЗатаркиТранспортировочныхМест.ВесНеттоВлажный * ДанныеЗатаркиТранспортировочныхМест.Влажность / 100 КАК ЧИСЛО(15, 0)) КАК ВесНеттоСухой,
			|	ЕСТЬNULL(ДанныеЛабораторныхИсследований.СодержаниеAu, 0) КАК СодержаниеЗолота,
			|	ЕСТЬNULL(ДанныеЛабораторныхИсследований.СодержаниеAg, 0) КАК СодержаниеСеребра,
			|	ЕСТЬNULL(ДанныеЛабораторныхИсследований.ПримесиSобщ, 0) КАК СодержаниеСеры,
			|	ЕСТЬNULL(ДанныеЛабораторныхИсследований.ПримесиCорг, 0) КАК СодержаниеУглеродов,
			|	ЕСТЬNULL(ДанныеЛабораторныхИсследований.ПримесиAs, 0) КАК СодержаниеМышьяка,
			|	ЕСТЬNULL(ДанныеЛабораторныхИсследований.ПримесиFe, 0) КАК СодержаниеЖелеза
			|ИЗ
			|	вт_ДанныеПодготовкиКПереработки КАК вт_ДанныеПодготовкиКПереработки
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеЗатаркиТранспортировочныхМест КАК ДанныеЗатаркиТранспортировочныхМест
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеЛабораторныхИсследований КАК ДанныеЛабораторныхИсследований
			|			ПО (ДанныеЛабораторныхИсследований.Партия = ДанныеЗатаркиТранспортировочныхМест.Партия)
			|		ПО вт_ДанныеПодготовкиКПереработки.ТранспортировочноеМесто = ДанныеЗатаркиТранспортировочныхМест.ТранспортировочноеМесто";
		
		Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ИтогоВесБруттоСырой 		= 0;
		ИтогоВесНеттоСырой 			= 0;
		ИтогоВлажность 				= 0;
		ИтогоВесНеттоСухой 			= 0;
		ИтогоСодержаниеЗолота 		= 0;
		ИтогоСодержаниеСеребра 		= 0;
		ИтогоСодержаниеСеры 		= 0;
		ИтогоСодержаниеУглеродов 	= 0;
		ИтогоСодержаниеМышьяка 		= 0;
		ИтогоСодержаниеЖелеза 		= 0;
		ИтогоКоличествоЗолота 		= 0;
		ИтогоКоличествоСеребра 		= 0;
		ИтогоКоличествоСеры 		= 0;
		ИтогоКоличествоУглеродов	= 0;
		ИтогоКоличествоМышьека 		= 0;
		ИтогоКоличествоЖелеза 		= 0;
		
		
		Ном = 0;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры,ВыборкаДетальныеЗаписи);
			Ном = Ном+1;
			
			ОбластьСтрока.Параметры.НомПартии = СсылкаНаОбъект.НомерПартииПереработки;
			КолЗолота 		= Окр(ВыборкаДетальныеЗаписи.ВесНеттоСухой*ВыборкаДетальныеЗаписи.СодержаниеЗолота/1000,2);
			КолСеребра 		= Окр(ВыборкаДетальныеЗаписи.ВесНеттоСухой*ВыборкаДетальныеЗаписи.СодержаниеСеребра/1000,2);
			КолСеры 		= Окр(ВыборкаДетальныеЗаписи.ВесНеттоСухой*ВыборкаДетальныеЗаписи.СодержаниеСеры/1000,2);
			КолУглеродов	= Окр(ВыборкаДетальныеЗаписи.ВесНеттоСухой*ВыборкаДетальныеЗаписи.СодержаниеУглеродов/1000,2);
			КолМышьека 		= Окр(ВыборкаДетальныеЗаписи.ВесНеттоСухой*ВыборкаДетальныеЗаписи.СодержаниеМышьяка/1000,2);
			КолЖелеза 		= Окр(ВыборкаДетальныеЗаписи.ВесНеттоСухой*ВыборкаДетальныеЗаписи.СодержаниеЖелеза/1000,2);
									
			ОбластьСтрока.Параметры.Ном = Ном;
			ОбластьСтрока.Параметры.КоличествоЗолота 	= КолЗолота;
			ОбластьСтрока.Параметры.КоличествоСеребра 	= КолСеребра;
			ОбластьСтрока.Параметры.КоличествоСеры 		= КолСеры;
			ОбластьСтрока.Параметры.КоличествоУглеродов	= КолУглеродов;
			ОбластьСтрока.Параметры.КоличествоМышьека 	= КолМышьека;
			ОбластьСтрока.Параметры.КоличествоЖелеза 	= КолЖелеза;
			
			ИтогоВесБруттоСырой 		= ИтогоВесБруттоСырой+ВыборкаДетальныеЗаписи.ВесБруттоСырой;
			ИтогоВесНеттоСырой 			= ИтогоВесНеттоСырой+ВыборкаДетальныеЗаписи.ВесНеттоСырой;
			ИтогоВесНеттоСухой 			= ИтогоВесНеттоСухой+ВыборкаДетальныеЗаписи.ВесНеттоСухой;
			ИтогоКоличествоЗолота 		= ИтогоКоличествоЗолота+КолЗолота;
			ИтогоКоличествоСеребра 		= ИтогоКоличествоСеребра+КолСеребра;
			ИтогоКоличествоСеры 		= ИтогоКоличествоСеры+КолСеры;
			ИтогоКоличествоУглеродов	= ИтогоКоличествоУглеродов+КолУглеродов;
			ИтогоКоличествоМышьека 		= ИтогоКоличествоМышьека+КолМышьека;
			ИтогоКоличествоЖелеза 		= ИтогоКоличествоЖелеза+КолЖелеза;
			
			ТабличныйДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
		ОбластьИтог.Параметры.ИтогоВесБруттоСырой 		= ИтогоВесБруттоСырой;
		ОбластьИтог.Параметры.ИтогоВесНеттоСырой 		= ИтогоВесНеттоСырой;
		ОбластьИтог.Параметры.ИтогоВлажность 			= Окр(100-(ИтогоВесНеттоСухой*100)/ИтогоВесНеттоСырой,2);
		ОбластьИтог.Параметры.ИтогоВесНеттоСухой 		= ИтогоВесНеттоСухой;
		ОбластьИтог.Параметры.ИтогоСодержаниеЗолота 	= Окр((ИтогоКоличествоЗолота/ИтогоВесНеттоСухой)*1000,2);
		ОбластьИтог.Параметры.ИтогоСодержаниеСеребра 	= Окр((ИтогоКоличествоСеребра/ИтогоВесНеттоСухой)*1000,2);
		ОбластьИтог.Параметры.ИтогоСодержаниеСеры 		= Окр((ИтогоКоличествоСеры/ИтогоВесНеттоСухой)*1000,2);
		ОбластьИтог.Параметры.ИтогоСодержаниеУглеродов 	= Окр((ИтогоКоличествоУглеродов/ИтогоВесНеттоСухой)*1000,2);
		ОбластьИтог.Параметры.ИтогоСодержаниеМышьяка 	= Окр((ИтогоКоличествоМышьека/ИтогоВесНеттоСухой)*1000,2);
		ОбластьИтог.Параметры.ИтогоСодержаниеЖелеза 	= Окр((ИтогоКоличествоЖелеза/ИтогоВесНеттоСухой)*1000,2);
		ОбластьИтог.Параметры.ИтогоКоличествоЗолота 	= ИтогоКоличествоЗолота;
		ОбластьИтог.Параметры.ИтогоКоличествоСеребра 	= ИтогоКоличествоСеребра;
		ОбластьИтог.Параметры.ИтогоКоличествоСеры 		= ИтогоКоличествоСеры;
		ОбластьИтог.Параметры.ИтогоКоличествоУглеродов	= ИтогоКоличествоУглеродов;
		ОбластьИтог.Параметры.ИтогоКоличествоМышьека 	= ИтогоКоличествоМышьека;
		ОбластьИтог.Параметры.ИтогоКоличествоЖелеза 	= ИтогоКоличествоЖелеза;
		ТабличныйДокумент.Вывести(ОбластьИтог);

	КонецЦикла;
	
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	
	Возврат ТабличныйДокумент;

КонецФункции
